"""
Примеры использования функций
2)  Однозначность функции - дело договоренности при помощи аннотирования

Аннотирование (аннотация типов) - указание ЖЕЛАЕМОГО типа какого -либо параметра
Чем можно аннотировать?
1.1) Всеми стандартными классами/типами и т .д. в языке
1.2) Познакомиться с модулем Typing
"""

def add(a :int, b :int) -> int:
    """
    description.........
    """
    return a + b

def main() -> None:
    """
    entry point
    """
    print(add(2,3))
    print(add("a", "b"))
    print(add([10,20,30], [40]))
    print(add((2,3), (4,5)))
    print(add(10.5, 10 ** 0.5))

main()