# Как сравнивать строки?
print("aa" > "ABCD")

# ord(str-len-1)-> int
# chr(int) -> str-len-1

print(f"ordinal of 'a' is:", ord("a"))
print(f"ordinal of 'A' is:", ord("A"))

print("a" > "A")

print("aa" > "aabcd")
# 1. Первая буква слева 'a' и первая буква справа 'a'
# 2. Вторая буква слева 'a' и вторая буква справа 'a'
# 3. Третья буква слева - отсутсвует, третья буква справа 'b'
# ничего всегда меньше чем что-то => буква справа больше, чем ничего слева =>
# слово справа больше чем слово слева.

print("ordinal if 'а' is", ord("а"))

# Сравнение строк (сравнение индексируемых коллекций)
# Индексируемые коллекции сравниваются поэлементно всегда!
# Это означает, что для сравнения lhs > rhs
# необходимо проверить для начала lhs[0] > rhs[0]?
# затем lhs[1] > rhs[1]......
# данный процесс продолжается до тех пор, пока не будет проставлен однозначно
# знак > или < (в случае если lhs[0] == rhs[0] - переходим к следующим элементам и т.д.)


print("68 is:", chr(68))